; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-18)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(free left)
(free right)
(at ball1 roomb)
(at ball2 room3)
(at ball3 room3)
(at ball4 room3)
(at ball5 room3)
(at ball6 room3)
(at ball7 room3)
(at ball8 room3)
(at ball9 room4)
(at ball10 room4)
(at ball11 room4)
(at ball12 room5)
(at ball13 room5)
(at ball14 room5)
(at ball15 room6)
(at ball16 room6)
(at ball17 room6)
(at ball18 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 room3)
(at ball2 room3)
(at ball3 room3)
(at ball4 room3)
(at ball5 room3)
(at ball6 room3)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 7 of 18
2. (pick ball1 roomb left)
   deleted: (at ball1 roomb) (free left)
   added: (carry ball1 left)
   goals met: 7 of 18
3. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 7 of 18
4. (pick ball18 room6 right)
   deleted: (at ball18 room6) (free right)
   added: (carry ball18 right)
   goals met: 7 of 18
5. (move room6 room3)
   deleted: (at-robby room6)
   added: (at-robby room3)
   goals met: 7 of 18
6. (drop ball18 room3 right)
   deleted: (carry ball18 right)
   added: (at ball18 room3) (free right)
   goals met: 8 of 18
7. (drop ball1 room3 left)
   deleted: (carry ball1 left)
   added: (at ball1 room3) (free left)
   goals met: 9 of 18
8. (move room3 room6)
   deleted: (at-robby room3)
   added: (at-robby room6)
   goals met: 9 of 18
9. (pick ball17 room6 left)
   deleted: (at ball17 room6) (free left)
   added: (carry ball17 left)
   goals met: 9 of 18
10. (pick ball16 room6 right)
   deleted: (at ball16 room6) (free right)
   added: (carry ball16 right)
   goals met: 9 of 18
11. (move room6 room3)
   deleted: (at-robby room6)
   added: (at-robby room3)
   goals met: 9 of 18
12. (drop ball16 room3 right)
   deleted: (carry ball16 right)
   added: (at ball16 room3) (free right)
   goals met: 10 of 18
13. (drop ball17 room3 left)
   deleted: (carry ball17 left)
   added: (at ball17 room3) (free left)
   goals met: 11 of 18
14. (move room3 room6)
   deleted: (at-robby room3)
   added: (at-robby room6)
   goals met: 11 of 18
15. (pick ball15 room6 left)
   deleted: (at ball15 room6) (free left)
   added: (carry ball15 left)
   goals met: 11 of 18
16. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 11 of 18
17. (pick ball14 room5 right)
   deleted: (at ball14 room5) (free right)
   added: (carry ball14 right)
   goals met: 11 of 18
18. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 11 of 18
19. (drop ball14 room3 right)
   deleted: (carry ball14 right)
   added: (at ball14 room3) (free right)
   goals met: 12 of 18
20. (drop ball15 room3 left)
   deleted: (carry ball15 left)
   added: (at ball15 room3) (free left)
   goals met: 13 of 18
21. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 13 of 18
22. (pick ball13 room5 left)
   deleted: (at ball13 room5) (free left)
   added: (carry ball13 left)
   goals met: 13 of 18
23. (pick ball12 room5 right)
   deleted: (at ball12 room5) (free right)
   added: (carry ball12 right)
   goals met: 13 of 18
24. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 13 of 18
25. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 13 of 18
26. (drop ball12 room3 right)
   deleted: (carry ball12 right)
   added: (at ball12 room3) (free right)
   goals met: 14 of 18
27. (drop ball13 room3 left)
   deleted: (carry ball13 left)
   added: (at ball13 room3) (free left)
   goals met: 15 of 18
28. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 15 of 18
29. (pick ball9 room4 left)
   deleted: (at ball9 room4) (free left)
   added: (carry ball9 left)
   goals met: 15 of 18
30. (pick ball11 room4 right)
   deleted: (at ball11 room4) (free right)
   added: (carry ball11 right)
   goals met: 15 of 18
31. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 15 of 18
32. (drop ball11 room3 right)
   deleted: (carry ball11 right)
   added: (at ball11 room3) (free right)
   goals met: 16 of 18
33. (drop ball9 room3 left)
   deleted: (carry ball9 left)
   added: (at ball9 room3) (free left)
   goals met: 17 of 18
34. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 17 of 18
35. (pick ball10 room4 left)
   deleted: (at ball10 room4) (free left)
   added: (carry ball10 left)
   goals met: 17 of 18
36. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 17 of 18
37. (drop ball10 room3 left)
   deleted: (carry ball10 left)
   added: (at ball10 room3) (free left)
   goals met: 18 of 18
